tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf4553_tdd.h
#define TRISC2                        522
#define TRISC_RC2                     523
#define TRISC6                        524
#define TRISC_RC6                     525
#define TRISC7                        526
#define TRISC_RC7                     527
#define TRISD                         528
#define TRISD_RD0                     529
#define TRISD0                        530
#define TRISD_RD1                     531
#define TRISD1                        532
#define TRISD_RD2                     533
#define TRISD2                        534
#define TRISD_RD3                     535
#define TRISD3                        536
#define TRISD_RD4                     537
#define TRISD4                        538
#define TRISD_RD5                     539
#define TRISD5                        540
#define TRISD_RD6                     541
#define TRISD6                        542
#define TRISD_RD7                     543
#define TRISD7                        544
#define TRISE                         545
#define TRISE_RE0                     546
#define TRISE0                        547
#define TRISE_RE1                     548
#define TRISE1                        549
#define TRISE_RE2                     550
#define TRISE2                        551
#define OSCTUNE                       552
#define TUN0                          553
#define TUN                           554
#define TUN1                          555
#define TUN2                          556
#define TUN3                          557
#define TUN4                          558
#define INTSRC                        559
#define PIE1                          560
#define TMR1IE                        561
#define TMR2IE                        562
#define CCP1IE                        563
#define SSPIE                         564
#define TXIE                          565
#define TX1IE                         566
#define RCIE                          567
#define RC1IE                         568
#define ADIE                          569
#define PSPIE                         570
#define SPPIE                         571
#define PIR1                          572
#define TMR1IF                        573
#define TMR2IF                        574
#define CCP1IF                        575
#define SSPIF                         576
#define TXIF                          577
#define TX1IF                         578
#define RCIF                          579
#define RC1IF                         580
#define ADIF                          581
#define PSPIF                         582
#define SPPIF                         583
#define IPR1                          584
#define TMR1IP                        585
#define TMR2IP                        586
#define CCP1IP                        587
#define SSPIP                         588
#define TX1IP                         589
#define TXIP                          590
#define RC1IP                         591
#define RCIP                          592
#define ADIP                          593
#define SPPIP                         594
#define PSPIP                         595
#define PIE2                          596
#define CCP2IE                        597
#define TMR3IE                        598
#define HLVDIE                        599
#define LVDIE                         600
#define BCLIE                         601
#define EEIE                          602
#define USBIE                         603
#define CMIE                          604
#define OSCFIE                        605
#define PIR2                          606
#define CCP2IF                        607
#define TMR3IF                        608
#define HLVDIF                        609
#define LVDIF                         610
#define BCLIF                         611
#define EEIF                          612
#define USBIF                         613
#define CMIF                          614
#define OSCFIF                        615
#define IPR2                          616
#define CCP2IP                        617
#define TMR3IP                        618
#define HLVDIP                        619
#define LVDIP                         620
#define BCLIP                         621
#define EEIP                          622
#define USBIP                         623
#define CMIP                          624
#define OSCFIP                        625
#define EECON1                        626
#define RD                            627
#define WR                            628
#define WREN                          629
#define WRERR                         630
#define FREE                          631
#define CFGS                          632
#define EEFS                          633
#define EEPGD                         634
#define RCSTA                         635
#define RCD8                          636
#define RX9D                          637
#define OERR                          638
#define FERR                          639
#define ADDEN                         640
#define ADEN                          641
#define CREN                          642
#define SRENA                         643
#define SREN                          644
#define RC9                           645
#define RC8_9                         646
#define RX9                           647
#define SPEN                          648
#define TXSTA                         649
#define TXD8                          650
#define TX9D1                         651
#define TX9D                          652
#define TRMT                          653
#define TRMT1                         654
#define BRGH1                         655
#define BRGH                          656
#define SENDB1                        657
#define SENDB                         658
#define SYNC                          659
#define SYNC1                         660
#define TXEN1                         661
#define TXEN                          662
#define TX91                          663
#define TX8_9                         664
#define TX9                           665
#define CSRC1                         666
#define CSRC                          667
#define T3CON                         668
#define TMR3ON                        669
#define TMR3CS                        670
#define nT3SYNC                       671
#define T3NSYNC                       672
#define NOT_T3SYNC                    673
#define T3SYNC                        674
#define SOSCEN3                       675
#define T3CCP1                        676
#define T3CKPS                        677
#define T3CKPS0                       678
#define T3CKPS1                       679
#define T3CCP2                        680
#define T3CON_RD16                    681
#define RD163                         682
#define T3RD16                        683
#define CMCON                         684
#define CM                            685
#define CMEN0                         686
#define CM0                           687
#define CMEN1                         688
#define CM1                           689
#define CMEN2                         690
#define CM2                           691
#define CIS                           692
#define C1INV                         693
#define C2INV                         694
#define C1OUT                         695
#define C2OUT                         696
#define CVRCON                        697
#define CVR                           698
#define CVR0                          699
#define CVR1                          700
#define CVR2                          701
#define CVR3                          702
#define CVRSS                         703
#define CVREF                         704
#define CVRR                          705
#define CVROEN                        706
#define CVROE                         707
#define CVREN                         708
#define ECCP1AS                       709
#define PSSBD                         710
#define PSSBD0                        711
#define PSSBD1                        712
#define PSSAC                         713
#define PSSAC0                        714
#define PSSAC1                        715
#define ECCPAS0                       716
#define ECCPAS                        717
#define ECCPAS1                       718
#define ECCPAS2                       719
#define ECCPASE                       720
#define ECCP1DEL                      721
#define PDC0                          722
#define PDC                           723
#define PDC1                          724
#define PDC2                          725
#define PDC3                          726
#define PDC4                          727
#define PDC5                          728
#define PDC6                          729
#define PRSEN                         730
#define BAUDCON                       731
#define ABDEN                         732
#define W4E                           733
#define WUE                           734
#define BRG16                         735
#define TXCKP                         736
#define SCKP                          737
#define RXCKP                         738
#define RXDTP                         739
#define RCMT                          740
#define RCIDL                         741
#define ABDOVF                        742
#define CCP2CON                       743
#define CCP2M                         744
#define CCP2M0                        745
#define CCP2M1                        746
#define CCP2M2                        747
#define CCP2M3                        748
#define DC2B0                         749
#define DC2B                          750
#define DC2B1                         751
#define CCP1CON                       752
#define CCP1M0                        753
#define CCP1M                         754
#define CCP1M1                        755
#define CCP1M2                        756
#define CCP1M3                        757
#define DC1B                          758
#define DC1B0                         759
#define DC1B1                         760
#define P1M                           761
#define P1M0                          762
#define P1M1                          763
#define ADCON2                        764
#define ADCS0                         765
#define ADCS                          766
#define ADCS1                         767
#define ADCS2                         768
#define ACQT0                         769
#define ACQT                          770
#define ACQT1                         771
#define ACQT2                         772
#define ADFM                          773
#define ADCON1                        774
#define PCFG0                         775
#define PCFG                          776
#define PCFG1                         777
#define PCFG2                         778
#define CHSN3                         779
#define PCFG3                         780
#define VCFG                          781
#define VCFG0                         782
#define VCFG01                        783
#define VCFG11                        784
#define VCFG1                         785
#define ADCON0                        786
#define ADON                          787
#define nDONE                         788
#define GO_nDONE                      789
#define NOT_DONE                      790
#define GODONE                        791
#define GO_DONE                       792
#define DONE                          793
#define GO_NOT_DONE                   794
#define GO                            795
#define CHS0                          796
#define CHS                           797
#define CHS1                          798
#define CHS2                          799
#define CHS3                          800
#define SSPCON2                       801
#define SEN                           802
#define RSEN                          803
#define PEN                           804
#define RCEN                          805
#define ACKEN                         806
#define ACKDT                         807
#define ACKSTAT                       808
#define GCEN                          809
#define SSPCON1                       810
#define SSPM0                         811
#define SSPM                          812
#define SSPM1                         813
#define SSPM2                         814
#define SSPM3                         815
#define CKP                           816
#define SSPEN                         817
#define SSPOV                         818
#define WCOL                          819
#define SSPSTAT                       820
#define BF                            821
#define UA                            822
#define R_NOT_W                       823
#define READ_WRITE                    824
#define NOT_W                         825
#define R_W                           826
#define nW                            827
#define RW                            828
#define nWRITE                        829
#define R                             830
#define NOT_WRITE                     831
#define R_nW                          832
#define I2C_READ                      833
#define START                         834
#define S                             835
#define I2C_START                     836
#define STOP                          837
#define I2C_STOP                      838
#define P                             839
#define NOT_A                         840
#define DATA_ADDRESS                  841
#define nA                            842
#define D_A                           843
#define D_nA                          844
#define D                             845
#define DA                            846
#define D_NOT_A                       847
#define NOT_ADDRESS                   848
#define nADDRESS                      849
#define I2C_DAT                       850
#define CKE                           851
#define SMP                           852
#define T2CON                         853
#define T2CKPS0                       854
#define T2CKPS                        855
#define T2CKPS1                       856
#define TMR2ON                        857
#define T2OUTPS0                      858
#define TOUTPS0                       859
#define TOUTPS                        860
#define T2OUTPS1                      861
#define TOUTPS1                       862
#define T2OUTPS2                      863
#define TOUTPS2                       864
#define T2OUTPS3                      865
#define TOUTPS3                       866
#define PR2                           867
#define WM0                           868
#define WM1                           869
#define WAIT0                         870
#define WAIT1                         871
#define EBDIS                         872
#define T1CON                         873
#define TMR1ON                        874
#define TMR1CS                        875
#define NOT_T1SYNC                    876
#define T1SYNC                        877
#define nT1SYNC                       878
#define T1OSCEN                       879
#define SOSCEN                        880
#define T1CKPS0                       881
#define T1CKPS                        882
#define T1CKPS1                       883
#define T1RUN                         884
#define T1CON_RD16                    885
#define T1RD16                        886
#define RCON                          887
#define BOR                           888
#define NOT_BOR                       889
#define nBOR                          890
#define POR                           891
#define nPOR                          892
#define NOT_POR                       893
#define PD                            894
#define nPD                           895
#define NOT_PD                        896
#define NOT_TO                        897
#define nTO                           898
#define TO                            899
#define nRI                           900
#define NOT_RI                        901
#define RI                            902
#define SBOREN                        903
#define nIPEN                         904
#define IPEN                          905
#define NOT_IPEN                      906
#define WDTCON                        907
#define SWDTE                         908
#define SWDTEN                        909
#define HLVDCON                       910
#define HLVDL                         911
#define HLVDL0                        912
#define LVV0                          913
#define LVDL0                         914
#define HLVDL1                        915
#define LVDL1                         916
#define LVV1                          917
#define HLVDL2                        918
#define LVV2                          919
#define LVDL2                         920
#define HLVDL3                        921
#define LVV3                          922
#define LVDL3                         923
#define HLVDEN                        924
#define LVDEN                         925
#define BGST                          926
#define IRVST                         927
#define IVRST                         928
#define VDIRMAG                       929
#define OSCCON                        930
#define SCS0                          931
#define SCS                           932
#define SCS1                          933
#define FLTS                          934
#define IOFS                          935
#define OSTS                          936
#define IRCF                          937
#define IRCF0                         938
#define IRCF1                         939
#define IRCF2                         940
#define IDLEN                         941
#define T0CON                         942
#define T0PS                          943
#define T0PS0                         944
#define T0PS1                         945
#define T0PS2                         946
#define PSA                           947
#define T0SE                          948
#define T0CS                          949
#define T08BIT                        950
#define TMR0ON                        951
#define STATUS                        952
#define C                             953
#define CARRY                         954
#define DC                            955
#define ZERO                          956
#define Z                             957
#define OV                            958
#define OVERFLOW                      959
#define N                             960
#define NEGATIVE                      961
#define INTCON3                       962
#define INT1IF                        963
#define INT1F                         964
#define INT2IF                        965
#define INT2F                         966
#define INT1E                         967
#define INT1IE                        968
#define INT2IE                        969
#define INT2E                         970
#define INT1P                         971
#define INT1IP                        972
#define INT2IP                        973
#define INT2P                         974
#define INTCON2                       975
#define RBIP                          976
#define TMR0IP                        977
#define T0IP                          978
#define INTEDG2                       979
#define INTEDG1                       980
#define INTEDG0                       981
#define RBPU                          982
#define NOT_RBPU                      983
#define nRBPU                         984
#define INTCON                        985
#define RBIF                          986
#define INT0F                         987
#define INT0IF                        988
#define T0IF                          989
#define TMR0IF                        990
#define RBIE                          991
#define INT0E                         992
#define INT0IE                        993
#define T0IE                          994
#define TMR0IE                        995
#define PEIE                          996
#define PEIE_GIEL                     997
#define GIEL                          998
#define GIE_GIEH                      999
#define GIE                           1000
#define GIEH                          1001
#define STKPTR0                       1002
#define STKPTR                        1003
#define STKPTR1                       1004
#define STKPTR2                       1005
#define STKPTR3                       1006
#define STKPTR4                       1007
#define STKUNF                        1008
#define STKOVF                        1009
#define STKFUL                        1010

#endif // _PIC18LF4553_H_
